{
  # ヘッダー追加
  if (NR == 1) {
    print "年月日（和暦）, 有症者, 無症状, 遡及フラグ, 概要, 参照先";
  }
  # a: 無症状病原体保有者の件数(Asymptomatic)
  # s: 患者の件数（有症状者）(Symptomatic)
  # f: 遡及フラグ
  a="";s="";f=0;

  # 症状別集計
  #a="";s="";
  an = match($3, "無症状病原体保有者");
  if ( an > 0 ) {
    a = substr( $3, an );
    gsub( /[^0-9]/, "", a );
  };
  sn = match($3, "患者");
  if ( sn >0 ) {
    s = substr($3, sn);
    gsub( /[^0-9]/, "",s); 
    if ( an > 0 ) {
      #gsub( a, "", s);
      s = substr(s, 1,length(s)-length(a));
    };
  };

  #遡及処理
  if ( $1 == "令和2年3月04日（水）" ) { s = 1; f = 1; }
  if ( $1 == "令和2年3月13日（金）" ) { s = 1; f = 1; }
  if ( $1 == "令和2年3月14日（土）" ) { s = 1; f = 1; }
  if ( $1 == "令和2年3月15日（日）" ) { a = 2; f = 1; }
  if ( $1 == "令和2年4月02日（木）" ) { a = a - 1; f = 1; }

  print "\"" $1 "\"" ","s"," a "," f ",\"" $3 "\"," $2
}
