BEGIN {
  OFS=",";
}
NR == 1{
  print $0;
}
NR > 1{
  if ($0 == "38 37,米19 18,10/25,西伯郡,20,女性,※10/26付項番変更" ) {
    print "37,米18,2020-10-25,西伯郡,20代,女性,※10/26付項番変更";
    next;
  }
  if ( $0 == "37 36,米18 17,10/25,西伯郡,50,女性,※10/26付項番変更" ) {
    print "36,米17,2020-10-25,西伯郡,50代,女性,※10/26付項番変更";
    next;
  }
  if ( $0 == "36 35,米17 16,9/18,境港市,50,女性,陽性者の入院先の医療従事者            ※10/26付項番変更") {
    print "35,米16,2020-09-18,境港市,50代,女性,陽性者の入院先の医療従事者※10/26付項番変更";
    next;
  }
  if ( $0 == "35 34,鳥15,9/16,三重県,50,男性,24～31例目濃厚接触者            ※10/26付項番変更" ) {
    print "34,鳥15,2020-09-16,三重県,50代,男性,24～31例目濃厚接触者※10/26付項番変更";
    next;
  }
  if ( $0 == "34 33,米16 15,9/14,東京都,50,男性,23～33例目接触可能性            ※10/26付項番変更" ) {
    print "33,米15,2020-09-14,東京都,50代,男性,23～33例目接触可能性※10/26付項番変更";
    next;
  }
  if ( $0 == "33,米15,9/14,鹿児島県,30,男性,23～32、34例目接触可能性            ※他県で陽性確認された者(国の退院基準を満たし退所)            ※本県の陽性者数にはカウントしない。" ) next;
  if ( $1 == "\"\"") next;
  split($3, report_date,/\//);
  gsub(/ /,"", $4);
  gsub(/ /, "", $7);
  if ($5 != 0) $5 = $5"代";
  printf "%d,%s,%04d-%02d-%02d,", $1, $2, 2020, report_date[1], report_date[2];
  print $4, $5, $6, $7;
}